Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: The default location of php.ini is a compile time option (see the FAQ entry), but can be changed for the CGI and CLI version with the -c command line switch, see the chapter about using PHP from the command line.
es: El formato es similar a la variable de entorno de sistema PATH: una lista de directorios separados por dos puntos en UNIX o por punto y coma en Windows.

source: You can also use the environment variable PHPRC for an additional path to search for a php.ini file.
es: Si además magic_quotes_sybase vale on, la comilla sencilla es marcada con otra comilla sencilla en lugar de la barra invertida.

source: Not every PHP directive is documented below.
es: Si magic_quotes_sybase está a on, la comilla simple es marcada con una comilla simple en lugar de la barra invertida cuando están habilitados magic_quotes_gpc o magic_quotes_runtime.

source: For a list of all directives, please read your well commented php.ini file.
es: Así se evita que scripts mal escritos puedan bloquear el servidor.

source: You may want to view the latest php.ini here from CVS.
es: Indica si se debe permitir el formato corto (??) de la etiqueta de apertura del PHP.

source: The default value for the PHP directive register_globals changed from on to off in PHP 4.2.0.
es: Nombre DNS o dirección IP del servidor de SMTP que el PHP bajo Windows deberá usar para enviar correo con la función mail().

source: Example 4-1. php.ini example
es: Los sistemas que no usan sendmail deberán fijar esta directiva al nombre del programa alternativo que ofrezca su sistema de correo, si es que existe.

source: ; any text on a line after an unquoted semicolon (;) is ignored [php]; section markers (text within square brackets) are also ignored; Boolean values can be set to either:; true, on, yes; or false, off, no, none register_globals = off magic_quotes_gpc = yes; you can enclose strings in double-quotes include_path = ".: / usr / local / lib / php "; backslashes are treated the same as any other character include_path = ".;c:\php\lib"
es: Nótese que si se ha excedido max_execution_time cuando finaliza la espera de un intento de conexión, el script será finalizado antes de que se pueda tomar una acción en caso de fallo.

source: Complete list of configure options
es: ¿Problemas?

source: How to change configuration settings
es: Seguridad

source: PHP offers an alternative syntax for some of its control structures; namely, if, while, for, foreach, and switch.
es: PHP ofrece una sintaxis altenativa para alguna de sus estructuras de control; a saber, if, while, for, y switch.

source: In each case, the basic form of the alternate syntax is to change the opening brace to a colon (:) and the closing brace to endif;, endwhile;, endfor;, endforeach;, or endswitch;, respectively.
es: En cada caso, la forma básica de la sintaxis alternativa es cambiar abrir-llave por dos puntos (:) y cerrar-llave por endif;, endwhile;, endfor;, or endswitch;, respectivamente.

source: A is equal to 5 ?php endif;?
es: A es igual a 5 ?php endif;?

source: In the above example, the HTML block "A is equal to 5" is nested within an if statement written in the alternative syntax.
es: En el ejemplo de arriba, el bloque HTML "A = 5" se anida dentro de una sentencia if escrita en la sintaxis alternativa.

source: The HTML block would be displayed only if $a is equal to 5.
es: El bloque HTML se mostraría solamente si $a fuera igual a 5.

source: The alternative syntax applies to else and elseif as well.
es: La sintaxis alternativa se aplica a else y también a elseif.

source: The following is an if structure with elseif and else in the alternative format:
es: La siguiente es una estructura if con elseif y else en el formato alternativo:

source: if ($a == 5): print "a equals 5"; print ".. ."; elseif ($a == 6): print "a equals 6"; print "!! !"; else: print "a is neither 5 nor 6"; endif;
es: if ($a == 5): print "a es igual a 5"; print ".. ."; elseif ($a == 6): print "a es igual a 6"; print "!! !"; else: print "a no es ni 5 ni 6"; endif;

source: See also while, for, and if for further examples.
es: Mirar también while, for, e if para más ejemplos.

source: break ends execution of the current for, foreach while, do..while or switch structure.
es: break escapa de la estructuras de control iterante (bucle) actuales for, while, o switch.

source: break accepts an optional numeric argument which tells it how many nested enclosing structures are to be broken out of.
es: break accepta un parámetro opcional, el cual determina cuantas estructuras de control hay que escapar.

source: continue is used within looping structures to skip the rest of the current loop iteration and continue execution at the beginning of the next iteration.
es: continue se usa dentro de la estructura del bucle para saltar el resto de la iteración actual del bucle y continuar la ejecución al comienzo de la siguiente iteración.

source: continue accepts an optional numeric argument which tells it how many levels of enclosing loops it should skip to the end of.
es: continue accepta un parámetro opcional, el cual determina cuantos niveles (bluces) hay que saltar antes de continuar con la ejecución.

source: while (list ($key, $value) = each ($arr)) {if (!($key% 2)) {/ / skip odd members continue;} do_something_odd ($value);} $i = 0; while ($i+ + 5) {echo "Outer br \n"; while (1) {echo "nbsp; nbsp;Middle br \n"; while (1) {echo" nbsp; nbsp;Inner br \n"; continue 3;} echo "This never gets output. br \n";} echo "Neither does this. br \n";}
es: while (list($key,$value) = each($arr)) {if ($key% 2) {/ / salta los miembros impares continue;} do_something_odd ($value);} $i = 0; while ($i+ + 5) {echo "Outer br \n"; while (1) {echo "Middle br \n"; while (1) {echo" Inner br \n"; continue 3;} echo "This never gets output. br \n";} echo "Neither does this. br \n";}

source: do..while loops are very similar to while loops, except the truth expression is checked at the end of each iteration instead of in the beginning.
es: Los bucles do..while son muy similares a los bucles while, excepto que las condiciones se comprueban al final de cada iteración en vez de al principio.

source: The main difference from regular while loops is that the first iteration of a do..while loop is guaranteed to run (the truth expression is only checked at the end of the iteration), whereas it's may not necessarily run with a regular while loop (the truth expression is checked at the beginning of each iteration, if it evaluates to FALSE right from the beginning, the loop execution would end immediately).
es: La principal diferencia frente a los bucles regulares while es que se garantiza la ejecución de la primera iteración de un bucle do..while (la condición se comprueba sólo al final de la iteración), mientras que puede no ser necesariamente ejecutada con un bucle while regular (la condición se comprueba al principio de cada iteración, si esta se evalúa como FALSE desde el principio la ejecución del bucle finalizará inmediatamente).

source: There is just one syntax for do..while loops:
es: Hay una sola sintaxis para los bucles do..while:

source: The above loop would run one time exactly, since after the first iteration, when truth expression is checked, it evaluates to FALSE ($i is not bigger than 0) and the loop execution ends.
es: El bucle de arriba se ejecutaría exactamente una sola vez, después de la primera iteración, cuando la condición se comprueba, se evalúa como FALSE ($i no es más grande que 0) y la ejecución del bucle finaliza.

source: Advanced C users may be familiar with a different usage of the do..while loop, to allow stopping execution in the middle of code blocks, by encapsulating them with do..while (0), and using the break statement.
es: Los usuarios avanzados de C pueden estar familiarizados con un uso distinto del bucle do..while, para permitir parar la ejecución en medio de los bloques de código, encapsulandolos con do..while (0), y usando la sentencia break.

source: The following code fragment demonstrates this:
es: El siguiente fragmento de código demuestra esto:

source: do {if ($i 5) {print "i is not big enough"; break;} $i *= $factor; if ($i $minimum_limit) {break;} print "i is ok"; ...process i...} while(0);
es: do {if ($i 5) {print "i no es lo suficientemente grande"; break;} $i *= $factor; if ($i $minimum_limit) {break;} print "i es correcto"; ...procesa i...} while(0);

source: Don' t worry if you don't understand this right away or at all.
es: No se preocupes si no entiende esto completamente o en absoluto.

source: You can code scripts and even powerful scripts without using this' feature '.
es: Se pueden codificar archivos de comandos e incluso archivos de comandos potentes sin usar esta 'propiedad'.

source: Often you 'd want to execute a statement if a certain condition is met, and a different statement if the condition is not met.
es: A menudo queremos ejecutar una sentencia si se cumple una cierta condicion, y una sentencia distinta si la condición no se cumple.

source: This is what else is for. else extends an if statement to execute a statement in case the expression in the if statement evaluates to FALSE.
es: Esto es para lo que sirve else. else extiende una sentencia if para ejecutar una sentencia en caso de que la expresión en la sentencia if se evalúe como FALSE.

source: For example, the following code would display a is bigger than b if $a is bigger than $b, and a is NOT bigger than b otherwise:
es: Por ejemplo, el siguiente código mostraría a es mayor que b si $a fuera mayor que $b, y a NO es mayor que b en cualquier otro caso:

source: if ($a $b) {print "a is bigger than b";} else {print "a is NOT bigger than b";}
es: if ($a $b) {print "a es mayor que b";} else {print "a NO es mayor que b";}

source: elseif, as its name suggests, is a combination of if and else.
es: elseif, como su nombre sugiere, es una combinación de if y else.

source: Like else, it extends an if statement to execute a different statement in case the original if expression evaluates to FALSE.
es: Como else, extiende una sentencia if para ejecutar una sentencia diferente en caso de que la expresión if original se evalúa como FALSE.

source: However, unlike else, it will execute that alternative expression only if the elseif conditional expression evaluates to TRUE.
es: No obstante, a diferencia de else, ejecutará esa expresión alternativa solamente si la expresión condicional elseif se evalúa como TRUE.

source: For example, the following code would display a is bigger than b, a equal to b or a is smaller than b:
es: Por ejemplo, el siguiente código mostraría a es mayor que b, a es igual a b o a es menor que b:

source: if ($a $b) {print "a is bigger than b";} elseif ($a == $b) {print "a is equal to b";} else {print "a is smaller than b";}
es: if ($a $b) {print "a es mayor que b";} elseif ($a == $b) {print "a es igual que b";} else {print "a es mayor que b";}

source: There may be several elseif s within the same if statement.
es: Puede haber varios elseif s dentro de la misma sentencia if.

source: The first elseif expression (if any) that evaluates to TRUE would be executed.
es: La primera expresión elseif (si hay alguna) que se evalúe como TRUE se ejecutaría.

source: In PHP, you can also write 'else if' (in two words) and the behavior would be identical to the one of'elseif '(in a single word).
es: En PHP, también se puede escribir 'else if' (con dos palabras) y el comportamiento sería idéntico al de un 'elseif '(una sola palabra).

source: The syntactic meaning is slightly different (if you're familiar with C, this is the same behavior) but the bottom line is that both would result in exactly the same behavior.
es: El significado sintáctico es ligeramente distinto (si estas familiarizado con C, es el mismo comportamiento) pero la línea básica es que ambos resultarían tener exactamente el mismo comportamiento.

source: The elseif statement is only executed if the preceding if expression and any preceding elseif expressions evaluated to FALSE, and the current elseif expression evaluated to TRUE.
es: La sentencia elseif se ejecuta sólo si la expresión if precedente y cualquier expresión elseif precedente se evalúan como FALSE, y la expresión elseif actual se evalúa como TRUE.

source: Alternative syntax for control structures
es: Sintaxis Alternativa de Estructuras de Control

source: This simply gives an easy way to iterate over arrays. foreach works only on arrays, and will issue an error when you try to use it on a variable with a different data type or an uninitialized variables.
es: Esto simplemente da un modo fácil de iterar sobre arrays.

source: There are two syntaxes; the second is a minor but useful extension of the first:
es: Hay dos sintaxis; la segunda es una extensión menor, pero útil de la primera:

source: foreach( array_expression as $value) statement foreach(array_expression as $key = $value) statement
es: foreach( expresion_array as $value) sentencia foreach(expresion_array as $key = $value) sentencia

source: The first form loops over the array given by array_expression.
es: La primera forma recorre el array dado por expresion_array.

source: On each loop, the value of the current element is assigned to $value and the internal array pointer is advanced by one (so on the next loop, you'll be looking at the next element).
es: En cada iteración, el valor del elemento actual se asigna a $value y el puntero interno del array se avanza en una unidad (así en el siguiente paso, se estará mirando el elemento siguiente).

source: The second form does the same thing, except that the current element 's key will be assigned to the variable $key on each loop.
es: La segunda manera hace lo mismo, salvo que la clave del elemento actual será asignada a la variable $key en cada iteración.

source: When foreach first starts executing, the internal array pointer is automatically reset to the first element of the array.
es: Cuando foreach Cuando foreach comienza su primera ejecución, el puntero interno a la lista (array) se reinicia automáticamente al primer elemento del array.

source: This means that you do not need to call reset() before a foreach loop.
es: Esto significa que no se necesita llamar a reset() antes de un bucle foreach.

source: Assuming the foreach loop runs to completion, the array 's internal pointer will be at the end of the array.
es: Hay que tener en cuanta que foreach con una copia de la lista (array) especificada y no la lista en si, por ello el puntero de la lista no es modificado como en la construcción each.

source: You may have noticed that the following are functionally identical:
es: Puede haber observado que las siguientes son funcionalidades idénticas:

source: reset ($arr); while (list(, $value) = each ($arr)) {echo "Value: $value br \n";} foreach ($arr as $value) {echo "Value: $value br \n";}
es: reset( $arr); while (list (, $value) = each ($arr)) {echo "Valor: $value br \n";} foreach ($arr as $value) {echo "Valor: $value br \n";}

source: reset ($arr); while (list($key, $value) = each ($arr)) {echo "Key: $key; Value: $value br \n";} foreach ($arr as $key = $value) {echo "Key: $key; Value: $value br \n";}
es: reset( $arr); while (list ($key, $value) = each ($arr)) {echo "Key: $key; Valor: $value br \n";} foreach ($arr as $key = $value) {echo "Key: $key; Valor: $value br \n";}

source: Some more examples to demonstrate usages:
es: Algunos ejemplos más para demostrar su uso:

source: /* foreach example 1: value only * / $a = array (1, 2, 3, 17); foreach ($a as $v) {print "Current value of \$a: $v.\n";} / * foreach example 2: value (with key printed for illustration) * / $a = array (1, 2, 3, 17); $i = 0; / * for illustrative purposes only * / foreach($a as $v) {print "\$a[$i] = $v.\n"; $i++;} / * foreach example 3: key and value * / $a = array ("one "= 1, "two" = 2, "three "= 3, "seventeen" = 17); foreach($a as $k = $v) {print "\$a[$k] = $v.\n";} / * foreach example 4: multi-dimensional arrays * / $a[0][0] = "a"; $a[0][1] = "b"; $a[1][0] = "y"; $a[1][1] = "z"; foreach($a as $v1) {foreach ($v1 as $v2) {print "$v2\n";}} / * foreach example 5: dynamic arrays * / foreach(array(1, 2, 3, 4, 5) as $v) {print "$v\n";}
es: /* foreach ejemplo 1: sólo valor* / $a = array( 1, 2, 3, 17); foreach($a as $v) {print "Valor actual de \$a: $v.\n";} / * foreach ejemplo 2: valor (con clave impresa para ilustrar) * / $a = array(1, 2, 3, 17); $i = 0; / * sólo para propósitos demostrativos * / foreach($a as $v) {print "\$a[$i] = $k.\n";} / * foreach ejemplo 3: clave y valor * / $a = array ("uno "= 1, "dos" = 2, "tres "= 3, "diecisiete" = 17); foreach($a as $k = $v) {print "\$a[$k] = $v.\n";}

source: for loops are the most complex loops in PHP.
es: Los bucles for son los bucles más complejos en PHP.

source: They behave like their C counterparts.
es: Se comportan como su contrapartida en C.

source: The syntax of a for loop is:
es: La sintaxis de un bucle for es:

source: for (expr1; expr2; expr3) statement
es: for (expr1; expr2; expr3) sentencia

source: The first expression (expr1) is evaluated (executed) once unconditionally at the beginning of the loop.
es: La primera expresión (expr1) se evalúa (ejecuta) incondicionalmente una vez al principio del bucle.

source: In the beginning of each iteration, expr2 is evaluated.
es: Al comienzo de cada iteración, se evalúa expr2.

source: If it evaluates to TRUE, the loop continues and the nested statement( s) are executed.
es: Si se evalúa como TRUE, el bucle continúa y las sentencias anidadas se ejecutan.

source: If it evaluates to FALSE, the execution of the loop ends.
es: Si se evalúa como FALSE, la ejecución del bucle finaliza.

source: At the end of each iteration, expr3 is evaluated (executed).
es: Al final de cada iteración, se evalúa (ejecuta) expr3.

source: Each of the expressions can be empty. expr2 being empty means the loop should be run indefinitely (PHP implicitly considers it as TRUE, like C).
es: Que expr2 esté vacía significa que el bucle debería correr indefinidamente (PHP implicitamente lo considera como TRUE, al igual que C).

source: This may not be as useless as you might think, since often you 'd want to end the loop using a conditional break statement instead of using the for truth expression.
es: Esto puede que no sea tan inútil como se podría pensar, puesto que a menudo se quiere salir de un bucle usando una sentencia break condicional en vez de usar la condición de for.

source: Consider the following examples.
es: Considera los siguientes ejemplos.

source: All of them display numbers from 1 to 10:
es: Todos ellos muestran números del 1 al 10:

source: /* example 1 * / for ($i = 1; $i = 10; $i++) {print $i;} / * example 2 * / for ($i = 1;;$i++) {if ($i 10) {break;} print $i;} / * example 3 * / $i = 1; for (;;) {if ($i 10) {break;} print $i; $i++;} / * example 4 * / for ($i = 1; $i = 10; print $i, $i++);
es: /* ejemplo 1 * / for ($i = 1; $i = 10; $i++) {print $i;} / * ejemplo 2 * / for ($i = 1;;$i++) {if ($i 10) {break;} print $i;} / * ejemplo 3 * / $i = 1; for (;;) {if ($i 10) {break;} print $i; $i++;} / * ejemplo 4 * / for ($i = 1; $i = 10; print $i, $i++);

source: Of course, the first example appears to be the nicest one (or perhaps the fourth), but you may find that being able to use empty expressions in for loops comes in handy in many occasions.
es: Por supuesto, el primer ejemplo parece ser el mas elegante (o quizás el cuarto), pero uno puede descubrir que ser capaz de usar expresiones vacías en bucles for resulta útil en muchas ocasiones.

source: PHP also supports the alternate "colon syntax" for for loops.
es: PHP también soporta la "sintaxis de dos puntos" alternativa para bucles for.

source: for (expr1; expr2; expr3): statement;...; endfor;
es: for (expr1; expr2; expr3): sentencia;...; endfor;

source: Other languages have a foreach Other languages have a foreach statement to traverse an array or hash.
es: Otros lenguajes poseen una sentencia foreach para traducir un array o una tabla hash.

source: PHP 3 has no such construct; PHP 4 does (see foreach).
es: PHP3 no posee tal construcción; PHP4 sí (ver foreach).

source: In PHP 3, you can combine while with the list() and each() functions to achieve the same effect.
es: En PHP3, se puede combinar while con las funciones list() y each() para conseguir el mismo efecto.

source: See the documentation for these functions for an example.
es: Mirar la documentación de estas funciones para ver un ejemplo.

source: Any PHP script is built out of a series of statements.
es: Todo archivo de comandos PHP se compone de una serie de sentencias.

source: A statement can be an assignment, a function call, a loop, a conditional statement of even a statement that does nothing (an empty statement).
es: Una sentencia puede ser una asignación, una llamada a función, un bucle, una sentencia condicional e incluso una sentencia que no haga nada (una sentencia vacía).

source: Statements usually end with a semicolon.
es: Las sentencias normalmente acaban con punto y coma.

source: In addition, statements can be grouped into a statement-group by encapsulating a group of statements with curly braces.
es: Además, las sentencias se pueden agrupar en grupos de sentencias encapsulando un grupo de sentencias con llaves.

source: A statement-group is a statement by itself as well.
es: Un grupo de sentencias es también una sentencia.

source: The various statement types are described in this chapter.
es: En este capítulo se describen los diferentes tipos de sentencias.

source: The if construct is one of the most important features of many languages, PHP included.
es: La construcción if es una de las más importantes características de muchos lenguajes, incluido PHP.

source: It allows for conditional execution of code fragments.
es: Permite la ejecución condicional de fragmentos de código.

source: PHP features an if structure that is similar to that of C:
es: PHP caracteriza una estructura if que es similar a la de C:

source: if (expr) statement
es: if (expr) sentencia

source: If expr evaluates to TRUE, PHP will execute statement, and if it evaluates to FALSE - it 'll ignore it.
es: Como se describe en la sección sobre expresiones, expr se evalúa a su valor condicional.

source: More information about what values evaluate to FALSE can be found in the 'Converting to boolean' section.
es: Si expr se evalúa como TRUE, PHP ejecutará la sentencia, y si se evalúa como FALSE - la ignorará.

source: The following example would display a is bigger than b if $a is bigger than $b:
es: El siguiente ejemplo mostraría a es mayor que b si $a fuera mayor que $b:

source: if ($a $b) print "a is bigger than b";
es: if ($a $b) print "a es mayor que b";

source: Often you 'd want to have more than one statement to be executed conditionally.
es: A menudo, se desea tener más de una sentencia ejecutada de forma condicional.

source: Of course, there 's no need to wrap each statement with an if clause.
es: Por supuesto, no hay necesidad de encerrar cada sentencia con una cláusula if.

source: Instead, you can group several statements into a statement group.
es: En vez de eso, se pueden agrupar varias sentencias en un grupo de sentencias.

source: For example, this code would display a is bigger than b if $a is bigger than $b, and would then assign the value of $a into $b:
es: Por ejemplo, este código mostraría a es mayor que b si $a fuera mayor que $b, y entonces asignaría el valor de $a a $b:

source: if ($a $b) {print "a is bigger than b"; $b = $a;}
es: if ($a $b) {print "a es mayor que b"; $b = $a;}
